AhmedAbd-ElFattah/STM32-Drivers/LMCAL/NVIC/NVIC_defs.h
/*
 * File Name --> NVIC_defs.h
 * Author	 --> Ahmed Mohamed Abd-Elfattah
 * Version	 --> 1.0.0
 * Layer	 --> LMCAL
 * Brief	 --> NVIC driver defines.
 * */

#ifndef LMCAL_NVIC_NVIC_DEFS_H_
#define LMCAL_NVIC_NVIC_DEFS_H_



#define		NVIC_WWDG						0
#define		NVIC_PVD						1
#define		NVIC_TAMP_STAMP					2
#define		NVIC_RTC_WKUP					3
#define		NVIC_FLASH						4
#define		NVIC_RCC						5
#define		NVIC_EXTI0						6
#define		NVIC_EXTI1						7
#define		NVIC_EXTI2						8
#define		NVIC_EXTI3						9
#define		NVIC_EXTI4						10
#define		NVIC_DMA1_Stream0				11
#define		NVIC_DMA1_Stream1				12
#define		NVIC_DMA1_Stream2				13
#define		NVIC_DMA1_Stream3				14
#define		NVIC_DMA1_Stream4				15
#define		NVIC_DMA1_Stream5				16
#define		NVIC_DMA1_Stream6				17
#define		NVIC_ADC						18
#define		NVIC_CAN1_TX					19
#define		NVIC_CAN1_RX0					20
#define		NVIC_CAN1_RX1					21
#define		NVIC_CAN1_SCE					22
#define		NVIC_EXTI9_5					23
#define 	NVIC_TIM1_BRK_TIM9				24
#define 	NVIC_TIM1_UP_TIM10				25
#define		NVIC_TIM1_TRG_COM_TIM11			26
#define		NVIC_TIM1_CC					27
#define		NVIC_TIM2						28
#define		NVIC_TIM3						29
#define		NVIC_TIM4						30
#define		NVIC_I2C1_EV					31
#define		NVIC_I2C1_ER					32
#define		NVIC_I2C2_EV					33
#define		NVIC_I2C2_ER					34
#define		NVIC_SPI1						35
#define		NVIC_SPI2						36
#define		NVIC_USART1						37
#define		NVIC_USART2						38
#define		NVIC_USART3						39
#define		NVIC_EXTI15_10					40
#define		NVIC_RTC_Alarm					41
#define		NVIC_OTG_FS_WKUP				42
#define		NVIC_TIM8_BRK_TIM12				43
#define		NVIC_TIM8_UP_TIM13				44
#define		NVIC_TIM8_TRG_COM_TIM14			45
#define		NVIC_TIM8_CC					46
#define		NVIC_DMA1_Stream7				47
#define		NVIC_FMC						48
#define		NVIC_SDIO						49
#define		NVIC_TIM5						50
#define		NVIC_SPI3						51
#define		NVIC_UART4						52
#define		NVIC_UART5						53
#define		NVIC_TIM6_DAC					54
#define		NVIC_TIM7						55
#define		NVIC_DMA2_Stream0				56
#define		NVIC_DMA2_Stream1				57
#define		NVIC_DMA2_Stream2				58
#define		NVIC_DMA2_Stream3				59
#define		NVIC_DMA2_Stream4				60
#define		NVIC_CAN2_TX					63
#define		NVIC_CAN2_RX0					64
#define		NVIC_CAN2_RX1					65
#define		NVIC_CAN2_SCE					66
#define		NVIC_OTG_FS						67
#define		NVIC_DMA2_Stream5				68
#define		NVIC_DMA2_Stream6				69
#define		NVIC_DMA2_Stream7				70
#define		NVIC_USART6						71
#define		NVIC_I2C3_EV					72
#define		NVIC_I2C3_ER					73
#define		NVIC_OTG_HS_EP1_OUT				74
#define		NVIC_OTG_HS_EP1_IN				75
#define		NVIC_OTG_HS_WKUP				76
#define		NVIC_OTG_HS						77
#define		NVIC_DCMI						78
#define		NVIC_FPU						81
#define		NVIC_SPI4						84
#define		NVIC_SAI1						87
#define		NVIC_SAI2						91
#define		NVIC_QuadSPI					92
#define		NVIC_HDMI_CEC					93
#define		NVIC_SPDIF_Rx					94
#define		NVIC_FMPI2C1					95
#define		NVIC_FMPI2C1_error				96


#endif /* LMCAL_NVIC_NVIC_DEFS_H_ */
